// src/constants/menu-labels.ts
export const MENU_LABELS = {
	// Главное меню
	SUNDAY: "⛪ Воскресное богослужение",
	GROUPS: "👥 Малые группы",
	CALENDAR: "📅 Церковный календарь",
	ABOUT: "🙌 О нас",

	// Навигация
	MAIN: "🏠 В главное меню",
	BACK: "⬅️ Назад",

	// ЛМГ
	NEXTLMG: "📅 Когда следующая встреча ЛМГ",
	ALL_LMG: "📖 Все встречи ЛМГ до конца сезона",
	CALENDAR_LMG: "ЛМГ",
	LMG_NEXT: "Когда следующая встреча ЛМГ",
	LMG_ALL: "Список всех встреч ЛМГ",

	// Раздел «О нас»
	CHANNEL: "📣 Канал",
	BELIEF: "🧭 Во что мы верим",
	HISTORY: "📜 Наша история",

	// Молитвенные собрания
	CALENDAR_PRAYER: "Молитвенные собрания",
	PRAYER_NEXT: "Следующее молитвенное",
	PRAYER_ALL: "Все будущие молитвенные",

	// Членские собрания
	CALENDAR_MEMBERS: "Членские собрания",
	MEMBERS_NEXT: "Следующее членское",
	MEMBERS_ALL: "Все будущие членские",

	// Календарь
	NEXT3: "🗓️ Показать три ближайших события",
	CALENDAR_NEXT3: "Показать три ближайших события",
	CALENDAR_HOLIDAYS: "Большие праздники",
	HOLIDAY_EASTER: "Узнать когда будет Пасха",

	// РВ
	HOLIDAY_RV: "Узнать даты РВ",

	// Отцы и дети - встреча сестер
	CALENDAR_FAMILY: "Отцы и дети / Встреча сестер",
	FAMILY_NEXT: "Следующая встреча Отцы и дети / Встреча сестер",
	FAMILY_ALL: "Список всех будущих встреч Отцы и дети / Встреча сестер",
};
